#+TITLE: Arquivo emacs-guiareferencia-bueno.org
#+DESCRIPTION: Principais atalhos do editor de texto emacs e atalhos que foram adicionados no arquivo de inicialização.
#+AUTHOR: André D. Bueno
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://github.com/fniessen/org-html-themes/blob/master/src/readtheorg_theme/css/readtheorg.css">
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+LANGUAGE: pt
#+OPTIONS: num:nil
#+TAGS: @ler(l) @testar(t) @testado(T) @atalhopessoal(p)


*** Equações:
C-c space : Apaga conteúdo da célula.?
C-c = : Para adicionar fórmulas em colunas.
C-u C-c = : Para inserir fórmulas (field formula).?
C-c + : Para somas (C-y confirma).
C-c ? : Para ver conteúdo da célula.

‘p20’ Seta para 20 dígitos de precisão.
‘N’ Interpreta a equação como número (resultado).
‘n3’ normal, ‘s3’ científico, ‘e2’ engenharia, ‘f4’ fixo.
A equação aparece na forma #+TBLFM: $5=vmean($3..$4).
Note que @2 indica linha 2. $3 indica coluna 3. 
Para indicar linha 2 e coluna 3 use @2$3.
C-c C-c : Para recalcular linha TBLFM selecionada.
Posso usar funções definidas:
tan($1): Tangente, sin($2): Seno,...
Média : vmean($1..$3), Soma : vsum($1..$3).
Posso definir onde se aplica: @7($3..$6)=vsum(@3..@6)
Posso usar elisp:
$6='( / (+ (* @2$3 $3) (* @2$4 $4)));N
‘if($1 < 20, teen, string(""))’
Ex:
| id | Nome    |   n1 |   n2 |  média | (n1*p1 + n2*p2) / (n1+n2) |
|    | Pesos   |    6 |    4 |        |                           |
|----+---------+------+------+--------+---------------------------|
|  0 | João    | 29.5 |  4.5 |    17. |                      19.5 |
|  1 | Pedro   | 29.5 |    5 |  17.25 |                      19.7 |
|  2 | Ana     |  55. |  5.5 |  30.25 |                      35.2 |
|  3 | Claudia | 105. |  4.5 |  54.75 |                      64.8 |
|    |         | 207. | 18.5 | 112.75 |                     131.6 |
#+TBLFM: $3=vsum(@4..@7)::$5=vmean($3..$4)
#+TBLFM: $6='( / (+ (* @2$3 $3) (* @2$4 $4)) (+ @2$3 @2$4));N
#+TBLFM: @7($3..$6)=vsum(@3..@6)

org-table-convert-region : Converte região em tabela.
C-c / : Converte região selecionada em tabela (org-table-create-or-convert-from-region)

Dica: o uso das equações no org-mode é interessante, mas requer atenção.
